[
    {
      "title": "1 — मीटिंग में बोलना",
      "situation": "मैंने टीम मीटिंग में अपना विचार रखा। कुछ लोगों ने मोबाइल निकाला और कोई तुरंत प्रतिक्रिया नहीं दी।",
      "automaticThought": "उन्होंने मुझे अनदेखा किया; मेरा विचार बेकार था।",
      "evidenceFor": "किसी ने तुरंत कोई समर्थन या प्रशंसा नहीं दिखाई और कुछ लोग फोन देख रहे थे।",
      "evidenceAgainst": "बाद में एक सहकर्मी ने मेरी बात की तारीफ़ की; वही व्यक्ति अक्सर मीटिंग के दौरान फोन देखता है।",
      "alternativeThought": "शायद वे व्यस्त थे या किसी जरूरी संदेश का जवाब दे रहे थे; मेरा विचार उपयोगी हो सकता है, मैं बाद में फॉलो-अप कर सकता/सकती हूँ।",
      "note": "अगली बार मैं मुख्य बिंदु संक्षेप में ईमेल कर दूँगा।"
    },
    {
      "title": "2 — दोस्त का जवाब नहीं देना",
      "situation": "मैंने अपने दोस्त को संवेदनशील संदेश भेजा, लेकिन उसने तुरंत जवाब नहीं दिया।",
      "automaticThought": "वह मुझसे नाराज़ है या अब मुझे पसंद नहीं करता।",
      "evidenceFor": "वह अभी तक जवाब नहीं दे रहा और आखिरी कुछ बार उसने देर से ही उत्तर दिया था।",
      "evidenceAgainst": "वह अक्सर व्यस्त रहता है और कई बार बाद में जवाब देकर माफी मांगता है।",
      "alternativeThought": "वह व्यस्त या फोन से दूर हो सकता है; मैं शांत होकर बाद में पूछूंगा/पूछूँगी।",
      "note": "अगर 48 घंटे में जवाब नहीं आया तो सौम्य तरीके से पूछूँगा/पूछूँगी।"
    },
    {
      "title": "3 — प्रस्तुति का डर",
      "situation": "मुझे अगले हफ्ते प्रस्तुति देनी है और मैं बहुत चिंतित हूँ।",
      "automaticThought": "मैं बोलते समय हद तक फेल हो जाऊँगा; लोग मुझे बेवकूफ समझेंगे।",
      "evidenceFor": "पिछली बार मेरी आवाज कांपी थी और मैं पूरी तरह आत्मविश्वासी नहीं था/थी।",
      "evidenceAgainst": "मैंने सामग्री अच्छी तरह तैयार की है; सहकर्मियों ने प्रैक्टिस में मदद की और फीडबैक सकारात्मक था।",
      "alternativeThought": "थोड़ी घबराहट सामान्य है; प्रैक्टिस से मैं बेहतर कर सकता/सकती हूँ और यह अनुभव सीखने योग्य है।",
      "note": "रिहर्सल करूँगा/करूँगी और एक मित्र से एक बार प्रैक्टिस करवा लूँगा/लूँगी।"
    },
    {
      "title": "4 — परिवार की आलोचना",
      "situation": "मेरे घरवालों ने मेरे करियर के निर्णय पर टिप्पणी की और उसे नकारात्मक बताया।",
      "automaticThought": "मेरा निर्णय गलत है; मैं असफल हो जाऊँगा/जाऊँगी।",
      "evidenceFor": "उन्होंने कड़े शब्दों का उपयोग किया और बहस की।",
      "evidenceAgainst": "कुछ परिवार के सदस्य पहले भी समर्थन दे चुके हैं; मैंने सोच-समझकर योजना बनाई है और विकल्प मौजूद हैं।",
      "alternativeThought": "यह उनकी चिंता और दृष्टिकोण है; मेरे पास कारण और योजना है; मैं पूरी जानकारी लेकर निर्णय समायोजित कर सकता/सकती हूँ।",
      "note": "वे अपनी चिंता जता रहे हैं — शांति से उनकी बात सुनूंगा/सुनूँगी और अपनी योजना समझाऊँगा/समझाऊँगी।"
    },
    {
      "title": "5 — फिटनेस प्रयास पर निराशा",
      "situation": "मैंने महीने भर से व्यायाम और डाइट का प्रयास किया लेकिन वजन घटा नहीं।",
      "automaticThought": "मेरे प्रयास बेकार हैं; मैं कभी सफल नहीं हो पाऊँगा/पाऊँगी।",
      "evidenceFor": "स्केल पर बदलाव छोटा था और मन थोड़ा निराश है।",
      "evidenceAgainst": "मैंने ऊर्जा और सहनशक्ति में सुधार देखा है; कपड़ों में फिट अलग महसूस होता है; वजन घटने में व्यक्तिगत अंतर होते हैं।",
      "alternativeThought": "प्रगति केवल स्केल पर नहीं मापी जाती; मैं छोटे लक्ष्यों पर ध्यान दूँगा/दूँगी और रणनीति समायोजित करूँगा/करूँगी।",
      "note": "ट्रैकर रखें, पोषण विशेषज्ञ से छोटी सलाह लें और 2 सप्ताह के लक्ष्य तय करूँगा/करूँगी।"
    }
  ]
  