{
  "id": "7day_mood_boost",
  "title": "7-Day Mood Boost",
  "shortDescription": "A supportive, skills-based introduction to CBT. In seven short sessions, learn how thoughts, feelings, and behaviours interact — then apply evidence-based micro-skills to improve mood, gain perspective, and build confidence.",
  "description": "This 7-day practice-focused program teaches foundational CBT techniques through short, engaging lessons (5–15 minutes each). You’ll learn how to observe automatic thoughts, separate facts from assumptions, build balanced alternative thoughts, and try small behavioural experiments to shift your emotional state. Each session includes a brief explanation, real-world examples, experiential practice (breathing, noticing, behavioural sampling), and reflective prompts that integrate smoothly with the app’s Thought Record / ABCD tools. The goal is not perfection — it’s gradual, repeatable progress.",
  "version": "2.1",
  "language": "en",
  "thumbnail": "images/thumb_mood_boost.png",
  "days": 7,
  "recommendedDailyMinutes": 8,
  "notes": "Blocks of type 'action' route to in-app tools (e.g., /thought, /abcd, /relax). 'exercise' blocks include suggested duration. Reflection prompts are designed to be copied into Thought Record or ABCD for deeper work.",
  "lessons": [
    {
      "id": "day-1-intro",
      "day": 1,
      "title": "Intro — Notice What’s Happening",
      "summary": "Build awareness. Learn CBT’s core principle and begin noticing automatic thoughts as they appear.",
      "minutes": 6,
      "blocks": [
        {
          "type": "text",
          "title": "CBT in One Paragraph",
          "content": "Cognitive Behavioural Therapy helps us understand how our thoughts, emotions, and actions influence one another. When we learn to notice and evaluate unhelpful thoughts, we can reduce emotional distress and choose healthier behaviours. This program focuses on short, repeatable skills rather than theory — skills you can use in daily life."
        },
        {
          "type": "text",
          "title": "Why Notice Thoughts?",
          "content": "Automatic thoughts are the quick interpretations that pop up in response to events. They can feel true but are often incomplete or biased. Awareness is step one — we cannot evaluate a thought we haven’t noticed. Example: You wave at someone; they don’t wave back → automatic thought: “They’re ignoring me.” This thought shifts your emotion even without evidence."
        },
        {
          "type": "exercise",
          "title": "Grounding + 1-Minute Breathing",
          "content": "Sit comfortably. Inhale 4 seconds → hold 1 → exhale 6. Stay with the physical sensations of breathing. When your mind drifts, gently note the thought and return attention to the breath — no judgment.",
          "durationMinutes": 1,
          "suggestedAction": "/relax"
        },
        {
          "type": "prompt",
          "title": "Daily Reflection (Very Short)",
          "content": "After breathing, write one sentence: “I noticed the thought: ___.” Add more later in Thought Record or ABCD if you like.",
          "suggestedAction": "/thought"
        },
        {
          "type": "text",
          "title": "Practical Tip",
          "content": "Give thoughts a short label (e.g., 'ignored', 'I’ll fail'). Labels make them easier to capture and test later."
        }
      ]
    },
    {
      "id": "day-2-automatic-thoughts",
      "day": 2,
      "title": "Automatic Thoughts — Spotting Them",
      "summary": "Learn to catch the rapid thoughts that influence emotions and behaviours.",
      "minutes": 8,
      "blocks": [
        {
          "type": "text",
          "title": "What Are Automatic Thoughts?",
          "content": "These are quick interpretations such as “They must be upset with me.” They arise instantly, often outside awareness, and can shift mood and behaviour. Recognising them allows us to investigate rather than react automatically."
        },
        {
          "type": "exercise",
          "title": "Thought Catch — Short Practice",
          "content": "For the next hour, when you notice a change in emotion (tense, low, annoyed), pause and ask, “What went through my mind?” Capture the first brief phrase that arises.",
          "durationMinutes": 5
        },
        {
          "type": "text",
          "title": "Examples",
          "content": "Event: A friend walks past without greeting you. Possible automatic thoughts: “They’re ignoring me,” “I must’ve upset them,” “They don’t like me.” Each thought leads to different emotions and actions."
        },
        {
          "type": "prompt",
          "title": "Journal",
          "content": "Record one automatic thought and associated feeling. e.g., “Thought: They ignored me. Feeling: Annoyed.” You can expand using Thought Record.",
          "suggestedAction": "/thought"
        }
      ]
    },
    {
      "id": "day-3-evidence",
      "day": 3,
      "title": "Evidence — Test the Thought",
      "summary": "Gather facts for and against a thought; develop a more balanced view.",
      "minutes": 10,
      "blocks": [
        {
          "type": "text",
          "title": "Why Gather Evidence?",
          "content": "Thoughts often omit context. Listing evidence ‘for’ and ‘against’ helps balance assumptions. This process reduces emotional intensity and increases clarity."
        },
        {
          "type": "prompt",
          "title": "Try It With a Recorded Thought",
          "content": "Choose a thought from yesterday. Write two facts supporting it and two facts contradicting it. Use observable evidence rather than opinions.",
          "suggestedAction": "/thought"
        },
        {
          "type": "exercise",
          "title": "Mini Behavioural Experiment",
          "content": "If your thought predicts an outcome (e.g., “If I try, I’ll fail”), design a small action you can take to learn from. Keep it safe and short. Observe what happens and note what you learned.",
          "durationMinutes": 5
        },
        {
          "type": "text",
          "title": "How to Choose Facts",
          "content": "Prefer observable data (e.g., “No reply after 2 hours”) over interpretations (e.g., “They don’t care”)."
        }
      ]
    },
    {
      "id": "day-4-alternative-thoughts",
      "day": 4,
      "title": "Alternative Thoughts",
      "summary": "Create realistic, workable alternatives using evidence.",
      "minutes": 8,
      "blocks": [
        {
          "type": "text",
          "title": "What Is an Alternative Thought?",
          "content": "An alternative thought is realistic and balanced — not blind optimism. It acknowledges the situation while offering a fairer interpretation supported by evidence."
        },
        {
          "type": "prompt",
          "title": "Write an Alternative",
          "content": "Based on evidence gathered, write a balanced alternative (e.g., “They may just be busy — I can check later.”).",
          "suggestedAction": "/abcd"
        },
        {
          "type": "exercise",
          "title": "Practice the Alternative",
          "content": "When the original thought appears, gently repeat your alternative 2–3 times and observe how emotions shift.",
          "durationMinutes": 3
        },
        {
          "type": "text",
          "title": "Examples of Alternatives",
          "content": "Automatic: “I’m terrible at presentations.” Alternative: “I was nervous, but some parts went well. With practice, I can improve.”"
        }
      ]
    },
    {
      "id": "day-5-behavioural-experiments",
      "day": 5,
      "title": "Behavioural Experiments",
      "summary": "Test predictions through small, real-world actions.",
      "minutes": 12,
      "blocks": [
        {
          "type": "text",
          "title": "Designing a Good Experiment",
          "content": "A strong experiment is safe, specific, and observable. For example: If the thought is, “If I speak, people will ignore me,” try sharing one small idea and note what happens."
        },
        {
          "type": "exercise",
          "title": "Plan a Tiny Experiment",
          "content": "Pick one short experiment (5–10 minutes). Before: write your prediction. After: record what happened and what you learned.",
          "durationMinutes": 10
        },
        {
          "type": "prompt",
          "title": "Reflect",
          "content": "What happened? Did the outcome support the thought? What did you learn about your prediction?",
          "suggestedAction": "/thought"
        },
        {
          "type": "text",
          "title": "Learning Mindset",
          "content": "Experiments are about learning, not success/failure. Any outcome is useful information."
        }
      ]
    },
    {
      "id": "day-6-self-compassion",
      "day": 6,
      "title": "Self-Compassion & Setbacks",
      "summary": "Respond kindly to challenges; maintain progress without harshness.",
      "minutes": 7,
      "blocks": [
        {
          "type": "text",
          "title": "Why Self-Compassion Matters",
          "content": "When we judge ourselves harshly, change becomes harder. A compassionate stance encourages continued learning and experimentation, even when things don’t go as planned."
        },
        {
          "type": "exercise",
          "title": "Compassion Phrase",
          "content": "Take 1 minute to repeat a short phrase: “It’s okay to struggle — I’m learning.” Notice how your body responds.",
          "durationMinutes": 1
        },
        {
          "type": "prompt",
          "title": "Note for Setbacks",
          "content": "Write one kind statement you’ll use next time you feel discouraged.",
          "suggestedAction": "/thought"
        },
        {
          "type": "text",
          "title": "Example Reframe",
          "content": "Instead of “I failed,” try “This didn’t go as expected; I can adjust and try again.”"
        }
      ]
    },
    {
      "id": "day-7-plan",
      "day": 7,
      "title": "Summary & Maintenance Plan",
      "summary": "Review skills, reflect on progress, and build a simple plan to continue.",
      "minutes": 10,
      "blocks": [
        {
          "type": "text",
          "title": "Review of Skills",
          "content": "You practised: noticing thoughts, collecting evidence, creating balanced alternatives, testing predictions, and responding compassionately. These tools build emotional resilience over time."
        },
        {
          "type": "prompt",
          "title": "Your 1-Week Plan",
          "content": "Choose two tiny habits for the next week (e.g., 1-minute breathing in the morning + 1 thought reflection in the evening). Add reminders.",
          "suggestedAction": "/thought"
        },
        {
          "type": "action",
          "title": "Keep Practising",
          "content": "Use Thought Record or ABCD when you notice strong thoughts. Return to lessons anytime. Repeating helpful exercises builds skill strength.",
          "extra": ["/thought", "/abcd"]
        },
        {
          "type": "text",
          "title": "Next Steps",
          "content": "If this program helped, consider repeating it or trying related programs (e.g., worry management, sleep skills). If mood difficulties feel severe or persistent, consider speaking to a mental health professional or using the app’s Get Help resources."
        }
      ]
    }
  ]
}
