{
    "id": "7day_mood_boost",
    "title": "7-दिन का मूड बूस्ट",
    "shortDescription": "CBT कौशलों पर आधारित कोमल 7-दिन का कार्यक्रम: स्वचालित विचार पहचानें, उनसे जुड़ा सबूत देखें, संतुलित विकल्प बनाएँ और छोटे व्यवहारिक प्रयोग करके मूड सुधारें।",
    "description": "यह दैनिक 5–15 मिनट के छोटे पाठों का कार्यक्रम है जो व्यावहारिक CBT तकनीकें सिखाता है और आपको अभ्यास करने के लिए मार्गदर्शित करता है। हर दिन में व्याख्या, उदाहरण, एक त्वरित अभ्यास और जर्नलिंग संकेत शामिल हैं — आप इन्हें Thought Record या ABCD में सेव कर सकते हैं।",
    "version": "2.0",
    "language": "hi",
    "days": 7,
    "recommendedDailyMinutes": 8,
    "notes": "‘action’ प्रकार के ब्लॉक्स ऐप के अंदर के मार्गों (/thought, /abcd, /relax) से जुड़ते हैं। 'exercise' ब्लॉक्स में अनुमानित समय दिया गया है।",
    "lessons": [
      {
        "id": "day-1-intro",
        "day": 1,
        "title": "परिचय — जो हो रहा है उसे पहचानें",
        "summary": "CBT का मूल विचार जानें और स्वचालित विचारों को पहचानने की सरल आदत सीखें।",
        "minutes": 6,
        "blocks": [
          {
            "type": "text",
            "title": "CBT क्या है?",
            "content": "CBT (संज्ञानात्मक व्यवहार थेरेपी) यह बताती है कि हमारे विचार, भावनाएँ और कार्य आपस में जुड़े होते हैं। यदि हम अपने स्वचालित, असहायक विचारों को पहचानते और परखते हैं तो हम अपने मूड और व्यवहार को नियंत्रित कर सकते हैं।"
          },
          {
            "type": "text",
            "title": "क्यों विचार नोट करें?",
            "content": "स्वचालित विचार अक्सर तुरंत और बिना सोचे आते हैं और मूड बदल देते हैं। उदाहरण: आपने एक मित्र को नमस्ते किया पर वे नहीं मिले — तुरंत विचार: 'उन्होंने मुझे अनदेखा किया' — यह विचार आपके मूड को बदल सकता है।"
          },
          {
            "type": "exercise",
            "title": "ग्राउंडिंग + 1-मिनट सांस",
            "content": "आराम से बैठें। 4 सेकंड में सांस लें, 1 सेकंड रोकें, 6 सेकंड में छोड़ें। 1 मिनट तक यह करें। जब विचार आएँ तो उन्हें बिना निर्णय के नोट करें और फिर सांस पर लौटें।",
            "durationMinutes": 1,
            "suggestedAction": "/relax"
          },
          {
            "type": "prompt",
            "title": "दैनिक चिंतन (संक्षेप)",
            "content": "अभ्यास के बाद एक वाक्य लिखें: 'अभ्यास के बाद मैंने यह विचार नोट किया: ___'। यदि चाहें तो इसे Thought Record में विस्तृत करें।",
            "suggestedAction": "/thought"
          }
        ]
      },
      {
        "id": "day-2-automatic-thoughts",
        "day": 2,
        "title": "स्वचालित विचार — उन्हें पहचानना",
        "summary": "तनाव के क्षणों में अचानक आने वाले स्वचालित विचारों को रोककर पहचानना सीखें।",
        "minutes": 8,
        "blocks": [
          {
            "type": "text",
            "title": "स्वचालित विचार क्या हैं?",
            "content": "ये वे त्वरित, अक्सर नकारात्मक विचार होते हैं जो घटनाओं के तुरंत बाद आते हैं और बिना सबूत के सच लगते हैं। इन्हें पहचानना पहला कदम है।"
          },
          {
            "type": "exercise",
            "title": "विचार पकड़ अभ्यास",
            "content": "अगले एक घंटे में जब भी आपका मूड बदले, रुकें और पूछें: 'अभी मेरे मन में क्या आया?' उसे एक छोटी पंक्ति में लिखें।",
            "durationMinutes": 5
          },
          {
            "type": "text",
            "title": "उदाहरण",
            "content": "परिदृश्य: किसी सहकर्मी ने आपका संदेश तुरंत नहीं पढ़ा। स्वचालित विचार: 'उन्होंने मुझे अनदेखा किया' या 'शायद वो मुझसे नाराज़ हैं'। अलग-अलग विचार अलग भावनाएँ देंगे — इसलिए नोट करें कि कैसा विचार आया।"
          },
          {
            "type": "prompt",
            "title": "जर्नल",
            "content": "एक स्वचालित विचार और उससे जुड़ी भावना लिखें (उदा: 'विचार: उन्होंने मुझे अनदेखा किया — भावना: चिढ़')। इसे Thought Record में विस्तार कर सकते हैं।",
            "suggestedAction": "/thought"
          }
        ]
      },
      {
        "id": "day-3-evidence",
        "day": 3,
        "title": "सबूत — विचार की जाँच करें",
        "summary": "किसी विचार के पक्ष और विपक्ष में तथ्य इकट्ठा करना सीखें — यह CBT का बुनियादी अभ्यास है।",
        "minutes": 10,
        "blocks": [
          {
            "type": "text",
            "title": "सबूत क्यों ज़रूरी है?",
            "content": "विचार अक्सर महत्वपूर्ण संदर्भ छोड़ देते हैं। पक्ष और विपक्ष के तथ्य सूचीबद्ध करने से आप अधिक संतुलित दृष्टिकोण पा सकते हैं।"
          },
          {
            "type": "prompt",
            "title": "किसी रिकॉर्ड किए हुए विचार के साथ ट्राय करें",
            "content": "कल का कोई एक स्वचालित विचार लें। उसके लिए 2 तथ्‍य और उसके खिलाफ 2 तथ्य लिखें। उदाहरण: 'मेरा बॉस मुझसे नफरत करता है' — FOR: (1) बॉस ने निर्देश दिए; (2) बॉस ने कल मेरी रिपोर्ट पर टिप्पणी की। AGAINST: (1) बॉस ने पिछले महीने तारीफ की; (2) बॉस ने जिम्मेदारियाँ दीं।",
            "suggestedAction": "/thought"
          },
          {
            "type": "exercise",
            "title": "छोटा व्यवहारिक प्रयोग",
            "content": "यदि विचार किसी नकारात्मक भविष्यवाणी से जुड़ा है तो उसे जाँचने के लिए 5–10 मिनट का एक सुरक्षित प्रयोग चुनें (उदा: किसी से मदद माँगना)। परिणाम को नोट करें और जो सीखा उसे लिखें।",
            "durationMinutes": 5
          },
          {
            "type": "text",
            "title": "तथ्यों का चुनाव कैसे करें",
            "content": "तथ्य चुनते समय व्यवहारिक/निष्पादन योग्य चीजें चुनें — 'उन्‍होंने 2 घंटे में जवाब नहीं दिया' (तथ्य) बनाम 'उन्हें मेरी परवाह नहीं' (व्याख्या)।"
          }
        ]
      },
      {
        "id": "day-4-alternative-thoughts",
        "day": 4,
        "title": "वैकल्पिक विचार",
        "summary": "दयालु और यथार्थवादी वैकल्पिक विचार बनाना और उनका अभ्यास करना सीखें।",
        "minutes": 8,
        "blocks": [
          {
            "type": "text",
            "title": "वैकल्पिक विचार क्या है?",
            "content": "यह एक यथार्थवादी, संतुलित विचार है जो उपलब्ध सबूत के आधार पर संभव हो। यह जज़्बाती नकारात्मकता से अलग, अधिक निष्पक्ष होता है।"
          },
          {
            "type": "prompt",
            "title": "एक वैकल्पिक विचार लिखें",
            "content": "कल के किसी विचार को लें और उसके लिए 1–2 वाक्यों में एक वैकल्पिक विचार लिखें (उदा: 'वे व्यस्त हो सकते हैं, मैं बाद में पूछ लूँगा')।",
            "suggestedAction": "/abcd"
          },
          {
            "type": "exercise",
            "title": "वैकल्पिक विचार का अभ्यास",
            "content": "जब वही मूल विचार फिर से आए, तो वैकल्पिक विचार को मन ही मन 2–3 बार दोहराएं और देखें कि आपकी भावना में क्या बदलाव आता है।",
            "durationMinutes": 3
          },
          {
            "type": "text",
            "title": "उदाहरण",
            "content": "स्वचालित: 'मैं प्रस्तुतियों में खराब हूँ' — वैकल्पिक: 'मुझे कुछ हिस्सों में कठिनाई हुई लेकिन तैयारी से सुधार हो सकता है; आज मैं एक छोटा हिस्सा दोहराऊँगा।'"
          }
        ]
      },
      {
        "id": "day-5-behavioural-experiments",
        "day": 5,
        "title": "व्यवहारिक प्रयोग",
        "summary": "छोटे, योजनाबद्ध प्रयोग करें ताकि आप देख सकें कि आपकी भविष्यवाणियाँ कितनी सटीक थीं।",
        "minutes": 12,
        "blocks": [
          {
            "type": "text",
            "title": "अच्छा प्रयोग कैसे डिज़ाइन करें",
            "content": "एक उपयोगी प्रयोग विशिष्ट, सुरक्षित और अवलोकनीय होना चाहिए। यह एक स्पष्ट भविष्यवाणी पर टेस्ट होना चाहिए (उदा: 'अगर मैं बात करूँगा, तो लोग अनदेखा करेंगे')."
          },
          {
            "type": "exercise",
            "title": "एक छोटा प्रयोग योजना बनाएं",
            "content": "5–10 मिनट का एक सरल प्रयोग चुनें — उदाहरण: मीटिंग में एक छोटा सवाल पूछें या किसी से त्वरित प्रतिक्रिया माँगें। पहले अनुमान लिखें, फिर हुआ क्या लिखा और जो सीखा उसे संक्षेप में लिखें।",
            "durationMinutes": 10
          },
          {
            "type": "prompt",
            "title": "परिणाम पर चिंतन",
            "content": "क्या हुआ? क्या परिणाम आपके अनुमान से मेल खाते थे? आपने क्या नया सीखा? इसे Thought Record में सेव करें।",
            "suggestedAction": "/thought"
          },
          {
            "type": "text",
            "title": "सीखने का नजरिया",
            "content": "परिणाम को 'सफलता या असफलता' नहीं बल्कि डेटा के रूप में लें — इससे आप अगले कदम बेहतर तय कर पाएँगे।"
          }
        ]
      },
      {
        "id": "day-6-self-compassion",
        "day": 6,
        "title": "स्व-करुणा और असफलताएँ",
        "summary": "असफलताओं पर दयालु प्रतिक्रिया देना और अभ्यास जारी रखना सीखें।",
        "minutes": 7,
        "blocks": [
          {
            "type": "text",
            "title": "स्व-करुणा क्यों अहम है",
            "content": "जब चीजें उम्मीद के अनुसार नहीं जातीं, तो कठोर आत्म-आलोचना प्रगति रोकती है। दयालुता सीखने और अभ्यास जारी रखने में मदद करती है।"
          },
          {
            "type": "exercise",
            "title": "दयालु वाक्य",
            "content": "1 मिनट लें: गहराई से सांस लें और फिर मन ही मन एक सरल दयालु वाक्य दोहराएँ जैसे — 'यह ठीक है कि मुझे मुश्किल हो रही है; मैं कोशिश जारी रख सकता/सकती हूँ।'",
            "durationMinutes": 1
          },
          {
            "type": "prompt",
            "title": "एक दयालु नोट लिखें",
            "content": "अगली बार जब आप असफल महसूस करें तो अपने लिए एक दयालु वाक्य लिखें जिससे आप खुद को संभाल सकें।",
            "suggestedAction": "/thought"
          },
          {
            "type": "text",
            "title": "उदाहरण व्यवहारिक बदलाव",
            "content": "बदले में कहें: 'मैंने आज एक कठिन चीज़ आज़माई' बजाय 'मैंने विफल कर दिया' — यह भाषा छोटे बदलाव लाती है।"
          }
        ]
      },
      {
        "id": "day-7-plan",
        "day": 7,
        "title": "सारांश और जारी रखने की योजना",
        "summary": "जो कुछ आपने सीखा उसका पुनरावलोकन करें और एक सरल योजना बनाएं ताकि आप अभ्यास जारी रख सकें।",
        "minutes": 10,
        "blocks": [
          {
            "type": "text",
            "title": "सीखे हुए कौशलों की समीक्षा",
            "content": "आपने सीखा: विचार पहचानना, सबूत इकट्ठा करना, वैकल्पिक विचार बनाना, छोटे प्रयोग करना और स्व-करुणा अपनाना। ये क्रमिक कौशल हैं — बार-बार करने से असर दिखेगा।"
          },
          {
            "type": "prompt",
            "title": "आपकी 1-सप्ताह योजना",
            "content": "2 छोटी आदत चुनें जिन्हें आप रोज़ 1 सप्ताह तक करेंगे (उदा: हर सुबह 1-मिनट सांस + शाम को 1 छोटा विचार-चेक)। इन्हें लिखें और रिमाइंडर लगाएँ।",
            "suggestedAction": "/thought"
          },
          {
            "type": "action",
            "title": "अभ्यास जारी रखें",
            "content": "जब भी कोई मजबूत विचार आए, तो Thought Record या ABCD worksheet खोलें और फिर से अभ्यास करें।",
            "extra": ["/thought", "/abcd"]
          },
          {
            "type": "text",
            "title": "अगले कदम",
            "content": "यदि आपको यह उपयोगी लगा तो इसे दोहराएँ या संबंधित कोर्स आज़माएँ (जैसे चिंता प्रबंधन)। यदि आपका मूड बहुत खराब है तो पेशेवर मदद लें।"
          }
        ]
      }
    ]
  }
  